tutorials/incompressible/pimpleFoam/RAS/wingMotion/wingMotion2D_simpleFoam/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type            forces;
    libs            ("libforces.so");

    writeControl    timeStep;
    writeInterval   10;
    log             false;

    patches         (wing);
    rho             rhoInf;
    rhoInf          1;
    CofR            (0.4974612746 -0.01671895744 0.125);
}

// ************************************************************************* //
